profile_results/session_20251215_234716/benchmark.txt
Running 20s test @ http://localhost:8080/
  4 threads and 200 connections
  Thread Stats   Avg      Stdev     Max   +/- Stdev
    Latency     2.66ms    0.87ms  31.62ms   78.66%
    Req/Sec    18.93k     1.72k   39.96k    84.16%
  1510865 requests in 20.10s, 354.45MB read
Requests/sec:  75166.62
Transfer/sec:     17.63MB